Repository: NewEXE/WPBackuper
Catalog: languages/wpb-*.po
Languages: ru_ru

source: WPBackuper Filesystem connection issue. See <a href="%1$s">plugin status page</a> for details.
ru_ru: WPBackuper: ошибка подключения к файловой системе. Откройте <a href="%1$s">страницу статуса плагина</a> для подробностей.

source: Settings saved.
ru_ru: Настройки сохранены.

source: E-mail not sent: %1$s
ru_ru: E-mail не отправлен: %1$s

source: Settings
ru_ru: Настройки

source: Temp directory cleared.
ru_ru: Папка с временными файлами очищена.

source: Something went wrong while cleaning temp dir.
ru_ru: Произошла ошибка при очистке папки с временными файлами.

source: General
ru_ru: Основные

source: Cron Schedule
ru_ru: Cron-расписание

source: System Status
ru_ru: Статус системы

source: PHP version
ru_ru: Версия PHP

source: FS connected
ru_ru: Файловая система подключена

source: Is successfully connected to filesystem?
ru_ru: Имеет ли плагин доступ к файловой системе?

source: Yes
ru_ru: Да

source: No
ru_ru: Нет

source: Is ZipArchive PHP library available?
ru_ru: PHP библиотека "ZipArchive" доступна?

source: Available
ru_ru: Доступна

source: Not available. Using PclZip instead
ru_ru: Недоступна. Используется PсlZip

source: exec()
ru_ru: exeс()

source: Is PHP function exec() is available and allowed for execution?
ru_ru: PHP функция exex() доступна и разрешена для использования?

source: Available and allowed
ru_ru: Доступна и разрешена

source: Not available and (or) not allowed. Using $wpdb instead
ru_ru: Не доступна и (или) не разрешена. Используется $wpdb

source: Is normal WP installation?
ru_ru: Обычная Wordpress установка?

source: WP was installed with Bedrock or no?
ru_ru: Wordpress установлен с помощью Bedroсk или нет?

source: Common WP installation
ru_ru: Обычная WP установка

source: Bedrock WP installation
ru_ru: Wordpress установлен через Bedroсk

source: Is debug enabled?
ru_ru: Режим отладки включён?

source: Is debug log enabled?
ru_ru: Запись журнала отладки включена?

source: Directory for backups
ru_ru: Папка для резервных копий

source: Dir <b>%s</b> is exists and writable
ru_ru: Папка <b>%s</b> существует и доступна для записи

source: Dir <b>%s</b> is NOT writable
ru_ru: Папка <b>%s</b> недоступна для записи

source: Log file path
ru_ru: Путь к лог-файлу

source: Full path to log file
ru_ru: Полный путь к лог-файлу

source: E-mail to send a backup
ru_ru: E-mail для отправки резервных копий

source: For example, %1$s
ru_ru: Например, %1$s

source: Enable
ru_ru: Включить

source: Activated
ru_ru: Активно

source: Event
ru_ru: Событие

source: Schedule
ru_ru: Расписание

source: Next execution in
ru_ru: Следующее выполнение через:

source: Execute now
ru_ru: Выполнить сейчас

source: In queue
ru_ru: В очереди

source: Send e-mail now
ru_ru: Отправить e-mail сейчас

source: Execute
ru_ru: Выполнить

source: Create backup now and download via browser. This may take some time.
ru_ru: Создать резервную копию и скачать в браузере. Может занять некоторое время.

source: Download files backup
ru_ru: Скачать резервную копию файлов

source: Download database backup
ru_ru: Скачать резервную копию базы даннх

source: Backups are save into temporary folder. You can clean this dir now.
ru_ru: Резервные копии сохраняютя во временную папку. Вы можете очистить эту папку сейчас.

source: Clean temp dir
ru_ru: Очистить временную папку

source: Filesystem connection problem
ru_ru: Проблема соединения с файловой системой

source: <p>Unable to get direct access to your file system. <b>Creating backup by cron (on schedule) will not work</b>. You need to store filesystem credentials permanently.</p> <p>There is a way to store the credentials permanently using the <code>wp-config.php</code> file.</p> <p>Use these options to store the FTP or SSH credentials:</p> <ol> <li><code>FTP_HOST</code>: The host name of the server.</li> <li><code>FTP_USER</code>: The username to use while connecting.</li> <li><code>FTP_PASS</code>: The password to use while connecting.</li> <li><code>FTP_PUBKEY</code>: The path of the public key which will be used while using SSH connection.</li> <li><code>FTP_PRIKEY</code>: The path of the private key which will be used while using SSH connection.</li> </ol> <p>Example:<p> <pre class="programmlisting"> define( "FTP_HOST", "ftp.example.org" ); define( "FTP_USER", "username" ); define( "FTP_PASS", "password" ); define( "FTP_PUBKEY", "/home/username/.ssh/id_rsa.pub" ); define( "FTP_PRIKEY", "/home/username/.ssh/id_rsa" ); </pre>
ru_ru: <p>Невозможно получить доступ к файловой системе. <b>Создание резевных копий (в т.ч. по сron-расписанию) не будет работать</b>. Вы должны указать учётные данные для соединения .</p> <p>Сделать это можно в файле <code>wp-config.php</code>.</p> <p>Используйте следующие опции, чтобы сохранить учётные данные от FTP или SSH:</p> <ol> <li><code>FTP_HOST</code>: Имя хоста.</li> <li><code>FTP_USER</code>: Имя пользователя.</li> <li><code>FTP_PASS</code>: Пароль.</li> <li><code>FTP_PUBKEY</code>: Путь к публичному ключу (в случае подключения по SSH).</li> <li><code>FTP_PRIKEY</code>: Путь к приватному ключу (в случае подключения по SSH).</li> </ol> <p>Например:<p> <pre class="programmlisting"> define( "FTP_HOST", "ftp.example.org" ); define( "FTP_USER", "username" ); define( "FTP_PASS", "password" ); define( "FTP_PUBKEY", "/home/username/.ssh/id_rsa.pub" ); define( "FTP_PRIKEY", "/home/username/.ssh/id_rsa" ); </pre>

source: Addition information links
ru_ru: Дополнительная информация

source: <a href="https://codex.wordpress.org/Editing_wp-config.php#WordPress_Upgrade_Constants">Editing wp-config.php on Codex</a><br /> <a href="https://roots.io/bedrock/docs/configuration-files/">Configuration Files (Bedrock)</a><br /> <a href="https://codex.wordpress.org/Filesystem_API">Filesystem API docs</a>
ru_ru: <a href="https://codex.wordpress.org/Editing_wp-config.php#WordPress_Upgrade_Constants">Редактирование wp-config.php (Codex)</a><br /> <a href="https://roots.io/bedrock/docs/configuration-files/">Конфигурационные файлы (Bedrock)</a><br /> <a href="https://codex.wordpress.org/Filesystem_API">Документация по Wordpress API</a>

source: Name
ru_ru: Имя

source: Status
ru_ru: Статус

source: Not set
ru_ru: Не задано

source: Create files backup and send by email
ru_ru: Создать резевную копию файлов и отправить по e-mail

source: Create database backup and send by email
ru_ru: Создать резервную копию базы данных и отправить по e-mail

source: Unknown
ru_ru: Неизвестно

source: Once Monthly
ru_ru: Каждый месяц

source: Twice Monthly
ru_ru: Два раза в месяц

source: Every Minute
ru_ru: Каждую минуту

source: Select schedule...
ru_ru: Выберите расписание

source: FS not connected
ru_ru: Файловая система не поключена

source: WPBackup: your WP DB backup
ru_ru: WPBackup: резервная копия базы данных

source: Howdy! Here your backup of WordPress Database.
ru_ru: Привет! Вот Ваша резервная копия базы данных.

source: Something went wrong while sending email via wp_mail
ru_ru: Что-то пошло не так при отправке e-mail через wp_mail

source: Something went wrong while executing "mysqldump"
ru_ru: Что-то пошло не так при выполнении "mysqldump"

source: Something went wrong while touch temp file
ru_ru: Что-то пошло не так во время выполнения "touсh" к временному файлу.

source: Something went wrong while put sql content to temp file
ru_ru: Что-то пошло не так при записи SQL-строки во временный файл

source: Something went wrong while getting list files for backup
ru_ru: Что-то пошло не так при получении файлов для создания резервной копии

source: WPBackup: your WP files backup
ru_ru: WPBackup: резервная копия файлов

source: Howdy! Here your backup of WordPress files.
ru_ru: Привет! Вот Ваша резервная копия файлов.

source: ZipArchive: Something went wrong while closing archive
ru_ru: ZipArchive: что-то пошло не так при закрытии архива

source: Something went wrong while archivation via ZipArchive
ru_ru: Что-то пошло не так во время архивации через ZipArchive

source: Archivation via PclZip not supported for now...
ru_ru: Архивация через PclZip пока не поддерживается...
